onvifcamera/src/commonTest/resources/probeResponse2.xml

<?xml version="1.0" encoding="UTF-8" ?>
<s:Envelope xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:dn="http://www.onvif.org/ver10/network/wsdl"
    xmlns:s="http://www.w3.org/2003/05/soap-envelope"
    xmlns:sc="http://www.w3.org/2003/05/soap-encoding"
    xmlns:tds="http://www.onvif.org/ver10/device/wsdl">
    <s:Header>
        <a:MessageID>uuid:d587f86c-aa2e-f57a-1b91-25f24725aa2e</a:MessageID>
        <a:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</a:To>
        <a:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</a:Action>
        <a:RelatesTo>uuid:44f881db-4b2e-43b6-913c-123d771d2f19</a:RelatesTo>
    </s:Header>
    <s:Body>
        <d:ProbeMatches>
            <d:ProbeMatch>
                <a:EndpointReference>
                    <a:Address>uuid:2a46daf1-86f6-91ad-5458-3d184eb186f6</a:Address>
                </a:EndpointReference>
                <d:Types>dn:NetworkVideoTransmitter tds:Device</d:Types>
                <d:Scopes>onvif://www.onvif.org/location/country/china
                    onvif://www.onvif.org/name/Amcrest onvif://www.onvif.org/hardware/IP5M-B1186E
                    onvif://www.onvif.org/Profile/Streaming
                    onvif://www.onvif.org/type/Network_Video_Transmitter
                    onvif://www.onvif.org/extension/unique_identifier
                    onvif://www.onvif.org/Profile/T
                </d:Scopes>
                <d:XAddrs>http://192.168.0.205/onvif/device_service</d:XAddrs>
                <d:MetadataVersion>1</d:MetadataVersion>
            </d:ProbeMatch>
        </d:ProbeMatches>
    </s:Body>
</s:Envelope>
